{
  "backend/main.mo": "Motoko canister handling user profiles, access control, categories, products, variants, and cart operations with permission checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of various frontend files across layout, catalog, product, hooks, and configuration.",
  "frontend/index.css": "Global Tailwind base styles defining color tokens, theming variables, and dark mode rules.",
  "frontend/index.html": "Root HTML file bootstrapping the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Application router configuration defining all storefront and admin routes using TanStack Router.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard component that checks admin status and blocks access with an error message if unauthorized.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button managing authentication state and clearing query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a dialog prompting new authenticated users to enter basic profile info and saves it via a mutation.",
  "frontend/src/components/branding/BrandMark.tsx": "Renders the brand logo image and text for Mixora.",
  "frontend/src/components/catalog/FeaturedCategories.tsx": "Shows a grid of featured categories with images linking to category pages.",
  "frontend/src/components/catalog/ProductCard.tsx": "Displays product details including name, price, category badge, and a wishlist button, linking to the product page.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with navigation links, support options, and branding credits.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides the main navigation bar with category links, cart/wishlist/account icons, and a mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the overall site layout including header, footer, routed content, and profile setup dialog.",
  "frontend/src/components/product/ReviewSection.tsx": "Handles displaying reviews and submitting new ones with rating and comment input.",
  "frontend/src/components/product/VariantSelector.tsx": "Allows selecting product variants by color or size using badge-style selectors.",
  "frontend/src/components/support/WhatsAppButton.tsx": "Opens a prefilled WhatsApp chat using configured support contact details.",
  "frontend/src/config/support.ts": "Exports WhatsApp support number and default message configuration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, status, and stored identity using Dfinity AuthClient.",
  "frontend/src/hooks/usePageMeta.ts": "Updates document title and optional meta description when pages load.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for categories, products, cart, reviews, and related mutations using the backend actor.",
  "frontend/src/hooks/useStripeCheckout.ts": "Creates Stripe checkout sessions via a backend actor and returns the session URL.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Displays account dashboard with profile info, admin link, and login prompts based on user authentication.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin table listing product categories with loading state support.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard displaying basic metrics and quick‑action guidance.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Provides the admin layout with navigation sidebar, route guarding, and outlet rendering.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays a simple admin orders page with placeholder text and sets page metadata.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Lists products, provides a dialog to add new products, and handles form submission via hooks.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Shows a placeholder admin support inbox page and sets page metadata.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Allows assigning user roles through a form using backend mutation hooks.",
  "frontend/src/pages/admin/StripeSetupPanel.tsx": "Shows Stripe configuration status and form to set secret key and allowed countries.",
  "frontend/src/pages/CartPage.tsx": "Shows shopping cart items, allows quantity updates and removal, and computes subtotal.",
  "frontend/src/pages/CategoryListingPage.tsx": "Lists products for a specific category with loading skeletons and page metadata updates.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout form handling shipping info, payment selection, cart summaries, and Stripe session creation.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero banner, promo section, and featured product categories.",
  "frontend/src/pages/OrdersPage.tsx": "Displays user's orders or prompts login if unauthenticated, with empty-state messaging.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows payment failure message with actions to retry checkout or return to cart.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays successful payment confirmation and navigation to orders or homepage.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail view with variants, reviews, rating, and add‑to‑cart functionality.",
  "frontend/src/pages/SupportPage.tsx": "Support contact form with validation and WhatsApp option for customer inquiries.",
  "frontend/src/pages/WishlistPage.tsx": "Shows wishlist or prompts login, with empty-state messaging when no items exist.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom themes, colors, fonts, and plugins.",
  "project_state.json": "Defines the project’s current e‑commerce build plan, including scope, architecture notes, authentication, payments, and category restrictions. Records existing implemented features, known issues, and versioning metadata."
}