{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, categories, cart management, and product variant utilities with authorization middleware.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing summarized descriptions of multiple frontend files for quick reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, theme variables, and dark mode overrides.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration defining storefront and admin routes wrapped by the site layout.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component that checks admin permissions and blocks access with an alert if unauthorized.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter basic profile info and submit it via a saveProfile mutation.",
  "frontend/src/components/branding/BrandMark.tsx": "Renders the site logo and brand name.",
  "frontend/src/components/catalog/FeaturedCategories.tsx": "Displays a grid of predefined product categories linking to their category pages.",
  "frontend/src/components/catalog/ProductCard.tsx": "Shows a product preview with name, price, description, category badge, and links to the product page.",
  "frontend/src/components/layout/Footer.tsx": "Footer with navigation links, WhatsApp support, and branding credits.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with navigation, cart and wishlist icons, user access, and mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout combining header, footer, routed content, and the profile setup dialog.",
  "frontend/src/components/product/ReviewSection.tsx": "Handles review submission for authenticated users and displays a list of product reviews.",
  "frontend/src/components/product/VariantSelector.tsx": "UI to select product variants by color and size using badges.",
  "frontend/src/components/support/WhatsAppButton.tsx": "Button opening a WhatsApp chat using configured support number and message.",
  "frontend/src/config/support.ts": "Defines support configuration including WhatsApp number and default message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login state and identity loading. Includes helpers for creating an auth client and exposing login, clear, and status flags.",
  "frontend/src/hooks/usePageMeta.ts": "Sets the page title and description meta tag on mount using React effects.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks that call backend actor methods for categories, products, reviews, cart operations, and user data.",
  "frontend/src/hooks/useStripeCheckout.ts": "Creates a Stripe checkout session via the backend actor and returns the session URL through a mutation hook.",
  "frontend/src/index.css": "Tailwind base and theme variables defining light/dark color palettes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AccountPage.tsx": "Renders the user account page with login prompts, profile data, shortcuts, and admin access when applicable.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Lists all categories in a table with ID, name, and parent category.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin dashboard metrics placeholders and a quick actions section.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Admin layout with sidebar navigation and route guard wrapping nested admin pages.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Simple orders admin page showing a header and placeholder text.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product management page listing products and providing a modal form to add new ones.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Support inbox admin page displaying a header and empty state message.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "User management page allowing admins to assign roles to users via a form.",
  "frontend/src/pages/admin/StripeSetupPanel.tsx": "Stripe configuration panel for viewing setup status and submitting API key and allowed countries.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart with item details, quantity updates, removal actions, and subtotal calculation.",
  "frontend/src/pages/CategoryListingPage.tsx": "Shows products for a given category, including loading skeletons and empty states.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles cart review, shipping info form, payment method selection, and Stripe checkout session creation.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage hero, promo banner, and featured categories with navigation links.",
  "frontend/src/pages/OrdersPage.tsx": "Shows user orders or prompts login if unauthenticated, currently displaying an empty state.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows payment failure message with navigation options to retry or return to cart.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays payment success confirmation with links to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays product details, variants, reviews, and allows authenticated users to add items to cart.",
  "frontend/src/pages/SupportPage.tsx": "Provides a support contact form and WhatsApp option, submitting user inquiries with validation.",
  "frontend/src/pages/WishlistPage.tsx": "Shows the wishlist or prompts login, currently displaying an empty wishlist state.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, and plugins.",
  "project_state.json": "Describes project state for a multi-category e-commerce site including architecture notes, image requirements, and existing implemented features. Includes metadata like schema version, project version, and known issues."
}