{
  "kind": "build_request",
  "title": "Remove Beauty and Health & Wellness categories site-wide (keep only Clothes, Jewellery, Fragrances)",
  "projectName": "Mixora Storefront",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Update the backend categories returned by `getCategories()` to remove Health & Wellness and Beauty categories completely, and ensure only the three top-level categories remain available site-wide: Clothes, Jewellery, and Fragrances.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "hide  this section in my site healthwealness, beauty  only need cloths, jwellery, fragness",
          "1"
        ]
      },
      "acceptanceCriteria": [
        "Calling `getCategories()` returns exactly 3 top-level categories corresponding to Clothes, Jewellery, and Fragrances.",
        "No backend API returns or depends on the removed categories (Beauty, Health & Wellness) as seeded/default categories."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Remove Beauty and Health & Wellness from all storefront navigation and category surfaces, keeping only Clothes, Jewellery, and Fragrances visible to users (header navigation, mobile menu, footer links, and featured categories grid).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove Health & Wellness and Beauty categories completely from the entire site (admin panel, products, categories, URLs, everything).",
          "1"
        ]
      },
      "acceptanceCriteria": [
        "Header category navigation (desktop and mobile) shows only Clothes, Jewellery, and Fragrances.",
        "Footer category links show only Clothes, Jewellery, and Fragrances.",
        "Home page featured categories grid shows only Clothes, Jewellery, and Fragrances and does not reference removed category images/labels."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Update category-related page metadata and labels so that category names/descriptions do not mention Beauty or Health & Wellness anywhere in customer-facing UI text (including Home page meta description/hero copy and Category listing page labels).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "hide  this section in my site healthwealness, beauty  only need cloths, jwellery, fragness",
          "1"
        ]
      },
      "acceptanceCriteria": [
        "Home page metadata/hero copy does not mention Beauty or Wellness.",
        "Category listing page displays correct names for the remaining categories and does not contain Beauty/Wellness in its category name mapping or meta description generation.",
        "All user-facing text related to categories is in English."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Ensure removed categories are not accessible through normal UI flows and that direct navigation to removed category IDs does not present them as valid categories.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove Health & Wellness and Beauty categories completely from the entire site (admin panel, products, categories, URLs, everything).",
          "1"
        ]
      },
      "acceptanceCriteria": [
        "There are no UI links/buttons that navigate to removed category IDs.",
        "If a user manually visits a removed/unknown category ID route, the page does not present Beauty/Wellness as a valid category name (e.g., uses a generic fallback name and shows an empty/appropriate state)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if state migration is required by the change.",
    "Do not edit files under frontend/src/components/ui or any other immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Do not serve any images through the backend; all images must remain static frontend assets."
  ],
  "nonGoals": [
    "Providing a downloadable ZIP file of the project.",
    "Adding new categories beyond Clothes, Jewellery, and Fragrances.",
    "Implementing new payment, authentication, or admin features unrelated to category removal."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}