{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Beauty and Health & Wellness categories from Mixora Storefront UI (keep only Clothes, Jewellery, Fragrances)",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Remove Beauty and Health & Wellness from all storefront navigation and featured category surfaces (header/mobile, footer, featured categories grid), leaving only Clothes, Jewellery, and Fragrances.",
      "acceptanceCriteria": [
        "Header category navigation (desktop and mobile) shows only Clothes, Jewellery, and Fragrances.",
        "Footer category links show only Clothes, Jewellery, and Fragrances.",
        "Home page featured categories grid shows only Clothes, Jewellery, and Fragrances and does not reference removed category images/labels."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "modify",
          "description": "Remove hardcoded Beauty/Wellness/Lifestyle categories from desktop nav and mobile sheet menu; ensure the header only renders links for Clothes (categoryId '1'), Jewellery (categoryId '5'), and Fragrances (categoryId '4')."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Remove footer links for Beauty and Wellness; ensure the footer 'Shop' section links only to Clothes (categoryId '1'), Jewellery (categoryId '5'), and Fragrances (categoryId '4')."
        },
        {
          "path": "frontend/src/components/catalog/FeaturedCategories.tsx",
          "operation": "modify",
          "description": "Update the featured categories grid to include only the 3 allowed categories and remove any references to Beauty/Wellness/Lifestyle labels and images; ensure it uses only these static assets: frontend/public/assets/generated/cat-clothing.dim_512x512.png, frontend/public/assets/generated/cat-jewellery.dim_512x512.png, frontend/public/assets/generated/cat-fragrance.dim_512x512.png."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Remove Beauty/Wellness mentions from category-related metadata and UI labels, ensuring only English labels for Clothes, Jewellery, and Fragrances appear in customer-facing text.",
      "acceptanceCriteria": [
        "Home page metadata/hero copy does not mention Beauty or Wellness.",
        "Category listing page displays correct names for the remaining categories and does not contain Beauty/Wellness in its category name mapping or meta description generation.",
        "All user-facing text related to categories is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update usePageMeta description and hero supporting copy so it only references Clothes, Jewellery, and Fragrances (and does not mention Beauty, Wellness, or Lifestyle)."
        },
        {
          "path": "frontend/src/pages/CategoryListingPage.tsx",
          "operation": "modify",
          "description": "Remove Beauty/Wellness/Lifestyle from the category name mapping and meta description generation; ensure the displayed category name is exactly 'Clothes', 'Jewellery', or 'Fragrances' for ids '1', '5', '4' respectively, and uses a neutral English fallback for unknown ids."
        },
        {
          "path": "frontend/src/components/catalog/ProductCard.tsx",
          "operation": "modify",
          "description": "Ensure the product card category badge does not surface removed category names by mapping known allowed category IDs/names to 'Clothes'/'Jewellery'/'Fragrances' and using a neutral fallback label for anything else."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Prevent removed/unknown categories from being treated as valid in UI flows and ensure direct navigation to removed/unknown category routes shows a generic fallback and appropriate empty state.",
      "acceptanceCriteria": [
        "There are no UI links/buttons that navigate to removed category IDs.",
        "If a user manually visits a removed/unknown category ID route, the page does not present Beauty/Wellness as a valid category name (e.g., uses a generic fallback name and shows an empty/appropriate state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "modify",
          "description": "Ensure no navigation UI renders links to removed category IDs (e.g., '2' or '3'); verify both desktop nav and mobile menu only include allowed category IDs."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Ensure footer navigation contains no links to removed category IDs and only links to allowed category routes."
        },
        {
          "path": "frontend/src/components/catalog/FeaturedCategories.tsx",
          "operation": "modify",
          "description": "Ensure featured category cards link only to allowed category routes and do not contain any removed category IDs or names."
        },
        {
          "path": "frontend/src/pages/CategoryListingPage.tsx",
          "operation": "modify",
          "description": "Harden the category route UI for unknown/removed category IDs by using a generic title/meta description and ensuring the page does not display Beauty/Wellness names (rely on neutral fallback plus the existing empty-state behavior when no products are returned)."
        }
      ]
    }
  ]
}